reyessanchezo/EENG340/Lab_3_motors/PSOC_Creator/ServoAndStepper/ServoAndStepper.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "PWM_Out_aliases.h"
#include "PWM_Out.h"
#include "Stepper_Clock.h"
#include "JoyX_aliases.h"
#include "JoyX.h"
#include "JoyY_aliases.h"
#include "JoyY.h"
#include "UART.h"
#include "ADC.h"
#include "PWM_Clock.h"
#include "PWM_Servo.h"
#include "ISR_MicroServoControl.h"
#include "ISR_Clock.h"
#include "ISR_StepperControl.h"
#include "Stepper_Step_aliases.h"
#include "Stepper_Step.h"
#include "Stepper_Direction_aliases.h"
#include "Stepper_Direction.h"
#include "PWM_Stepper.h"
#include "UART_IntClock.h"
#include "ADC_SAR.h"
#include "ADC_IntClock.h"
#include "ADC_TempBuf_dma.h"
#include "ADC_FinalBuf_dma.h"
#include "ADC_IRQ.h"
#include "ADC_SAR_Bypass_aliases.h"
#include "ADC_SAR_Bypass.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

